# Read The Dataset File

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Drop Unnecessery Data

In [4]:
df.drop(['Name','PassengerId','Ticket','Cabin'],axis=1,inplace=True)

In [5]:
df.drop_duplicates(inplace=True)

In [6]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

# Map String Into Numbers

In [7]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [8]:
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [9]:
df['Parch'].unique()

array([0, 1, 2, 5, 3, 4, 6], dtype=int64)

In [10]:
em = {'S':1, 'C':2 , 'Q':3 }
s = {'male':0, 'female':1}

In [11]:
df['Embarked'] = df['Embarked'].map(em)
df['Sex'] = df['Sex'].map(s)

In [12]:
df.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    0  22.0      1      0   7.2500       1.0
1         1       1    1  38.0      1      0  71.2833       2.0
2         1       3    1  26.0      0      0   7.9250       1.0
3         1       1    1  35.0      1      0  53.1000       1.0
4         0       3    0  35.0      0      0   8.0500       1.0

# Get Correlations

In [13]:
correlation_matrix = df.corr()
print(correlation_matrix['Survived'])

Survived    1.000000
Pclass     -0.336244
Sex         0.513615
Age        -0.084985
SibSp      -0.037597
Parch       0.069669
Fare        0.246669
Embarked    0.078946
Name: Survived, dtype: float64

# Drop Poor Correlatin Features

In [14]:
df.drop(['Age','SibSp','Parch','Embarked'],axis=1,inplace=True)

In [15]:
df.head()

   Survived  Pclass  Sex     Fare
0         0       3    0   7.2500
1         1       1    1  71.2833
2         1       3    1   7.9250
3         1       1    1  53.1000
4         0       3    0   8.0500

# Check For Null Values

In [16]:
print(df.isnull().sum())

Survived    0
Pclass      0
Sex         0
Fare        0
dtype: int64

# Prepare Train Data

In [17]:
y_train = df['Survived']
x_train = df.drop('Survived',axis=1)

# Prepare Test Data

In [18]:
x_test = pd.read_csv('test.csv')

In [19]:
x_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [20]:
x_test.drop(['Name','PassengerId','Ticket','Cabin','Age','SibSp','Parch','Embarked'],axis=1,inplace=True)

In [21]:
x_test['Sex'] = x_test['Sex'].map(s)

In [22]:
x_test.fillna(x_test.mean(), inplace=True)

In [23]:
x_test.head()

   Pclass  Sex     Fare
0       3    0   7.8292
1       3    1   7.0000
2       2    0   9.6875
3       3    0   8.6625
4       3    1  12.2875

In [24]:
y_test = pd.read_csv('gender_submission.csv')
y_test.fillna(y_test.mean(), inplace=True)

In [25]:
y_test.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [26]:
y_test.drop(['PassengerId'],axis=1,inplace=True)

# Train The Data

In [27]:
from sklearn.ensemble import RandomForestClassifier

In [28]:
model = RandomForestClassifier()
model.fit(x_train, y_train)

RandomForestClassifier()

# Test The Output

In [29]:
model.score(x_test,y_test)

0.84688995215311